# StairSetWFlight1M

## Description
Sets width of stair - not recommended for use

```pascal
FUNCTION StairSetWFlight1M(
				stair              : HANDLE;
				WidthOfFirstFlight : REAL) : BOOLEAN;
```

```python

def vs.StairSetWFlight1M(stair, WidthOfFirstFlight):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|stair|HANDLE||
|WidthOfFirstFlight|REAL||

## Version
Availability: from Vectorworks 2021
## Category
* Objects - Stairs